Tekla Open API Reference for Tekla Structures 2025
Distance.Parse Method (String)
 Parses a distance from a string representation using the current unit type and culture.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Distance Parse(
	string text
)
Public Shared Function Parse (
	text As String
) As Distance
Parameters
text
Type: System.String
The text to parse.
Return Value
Type: Distance
The representation of the specified distance.
Exceptions
Exception | Condition
FormatException | Thrown if the text does not represent a distance.
Examples
 This example shows how to parse a Distance instance from a string.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           Distance distance = Distance.Parse("3");
       }
}
See Also
Reference
Distance Structure
Parse Overload
Tekla.Structures.Datatype Namespace